Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id will be created
  + resource "aws_api_gateway_method" "individuals-id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples will be created
  + resource "aws_api_gateway_method" "individuals-id-biosamples" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples_post will be created
  + resource "aws_api_gateway_method" "individuals-id-biosamples_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants will be created
  + resource "aws_api_gateway_method" "individuals-id-g_variants" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants_post will be created
  + resource "aws_api_gateway_method" "individuals-id-g_variants_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id_post will be created
  + resource "aws_api_gateway_method" "individuals-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals_post will be created
  + resource "aws_api_gateway_method" "individuals_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.info will be created
  + resource "aws_api_gateway_method" "info" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.map will be created
  + resource "aws_api_gateway_method" "map" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.projects will be created
  + resource "aws_api_gateway_method" "projects" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.root-get will be created
  + resource "aws_api_gateway_method" "root-get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs will be created
  + resource "aws_api_gateway_method" "runs" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms will be created
  + resource "aws_api_gateway_method" "runs-filtering_terms" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms_post will be created
  + resource "aws_api_gateway_method" "runs-filtering_terms_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id will be created
  + resource "aws_api_gateway_method" "runs-id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses will be created
  + resource "aws_api_gateway_method" "runs-id-analyses" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses_post will be created
  + resource "aws_api_gateway_method" "runs-id-analyses_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants will be created
  + resource "aws_api_gateway_method" "runs-id-g_variants" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants_post will be created
  + resource "aws_api_gateway_method" "runs-id-g_variants_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id_post will be created
  + resource "aws_api_gateway_method" "runs-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs_post will be created
  + resource "aws_api_gateway_method" "runs_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method_response.admin_proxy will be created
  + resource "aws_api_gateway_method_response" "admin_proxy" {
      + http_method         = "ANY"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses will be created
  + resource "aws_api_gateway_method_response" "analyses" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "analyses-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "analyses-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id will be created
  + resource "aws_api_gateway_method_response" "analyses-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "analyses-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "analyses-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id_post will be created
  + resource "aws_api_gateway_method_response" "analyses-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses_post will be created
  + resource "aws_api_gateway_method_response" "analyses_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples will be created
  + resource "aws_api_gateway_method_response" "biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "biosamples-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id will be created
  + resource "aws_api_gateway_method_response" "biosamples-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-analyses" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-analyses_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-runs" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-runs_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples_post will be created
  + resource "aws_api_gateway_method_response" "biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.configuration will be created
  + resource "aws_api_gateway_method_response" "configuration" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets will be created
  + resource "aws_api_gateway_method_response" "datasets" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "datasets-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "datasets-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id will be created
  + resource "aws_api_gateway_method_response" "datasets-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples will be created
  + resource "aws_api_gateway_method_response" "datasets-id-biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "datasets-id-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "datasets-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals will be created
  + resource "aws_api_gateway_method_response" "datasets-id-individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets_post will be created
  + resource "aws_api_gateway_method_response" "datasets_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.dportal_proxy will be created
  + resource "aws_api_gateway_method_response" "dportal_proxy" {
      + http_method         = "ANY"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.entry_types will be created
  + resource "aws_api_gateway_method_response" "entry_types" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.filtering_terms will be created
  + resource "aws_api_gateway_method_response" "filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants will be created
  + resource "aws_api_gateway_method_response" "g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id will be created
  + resource "aws_api_gateway_method_response" "g_variants-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants_post will be created
  + resource "aws_api_gateway_method_response" "g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals will be created
  + resource "aws_api_gateway_method_response" "individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "individuals-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "individuals-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id will be created
  + resource "aws_api_gateway_method_response" "individuals-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples will be created
  + resource "aws_api_gateway_method_response" "individuals-id-biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id-biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "individuals-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals_post will be created
  + resource "aws_api_gateway_method_response" "individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.info will be created
  + resource "aws_api_gateway_method_response" "info" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.map will be created
  + resource "aws_api_gateway_method_response" "map" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.projects will be created
  + resource "aws_api_gateway_method_response" "projects" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.root-get will be created
  + resource "aws_api_gateway_method_response" "root-get" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs will be created
  + resource "aws_api_gateway_method_response" "runs" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "runs-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "runs-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id will be created
  + resource "aws_api_gateway_method_response" "runs-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-analyses will be created
  + resource "aws_api_gateway_method_response" "runs-id-analyses" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-analyses_post will be created
  + resource "aws_api_gateway_method_response" "runs-id-analyses_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "runs-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "runs-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id_post will be created
  + resource "aws_api_gateway_method_response" "runs-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs_post will be created
  + resource "aws_api_gateway_method_response" "runs_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_settings.BeaconApi will be created
  + resource "aws_api_gateway_method_settings" "BeaconApi" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = (known after apply)
          + metrics_enabled                            = (known after apply)
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 100
          + throttling_rate_limit                      = 10
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.sbeacon.aws_api_gateway_resource.admin will be created
  + resource "aws_api_gateway_resource" "admin" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "admin"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.admin_proxy will be created
  + resource "aws_api_gateway_resource" "admin_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses will be created
  + resource "aws_api_gateway_resource" "analyses" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "analyses"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-filtering_terms will be created
  + resource "aws_api_gateway_resource" "analyses-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-id will be created
  + resource "aws_api_gateway_resource" "analyses-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-id-g_variants will be created
  + resource "aws_api_gateway_resource" "analyses-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples will be created
  + resource "aws_api_gateway_resource" "biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_resource" "biosamples-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id will be created
  + resource "aws_api_gateway_resource" "biosamples-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id-analyses will be created
  + resource "aws_api_gateway_resource" "biosamples-id-analyses" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "analyses"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id-g_variants will be created
  + resource "aws_api_gateway_resource" "biosamples-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id-runs will be created
  + resource "aws_api_gateway_resource" "biosamples-id-runs" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "runs"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.configuration will be created
  + resource "aws_api_gateway_resource" "configuration" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "configuration"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets will be created
  + resource "aws_api_gateway_resource" "datasets" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "datasets"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-filtering_terms will be created
  + resource "aws_api_gateway_resource" "datasets-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id will be created
  + resource "aws_api_gateway_resource" "datasets-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-biosamples will be created
  + resource "aws_api_gateway_resource" "datasets-id-biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-filtering_terms will be created
  + resource "aws_api_gateway_resource" "datasets-id-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-g_variants will be created
  + resource "aws_api_gateway_resource" "datasets-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-individuals will be created
  + resource "aws_api_gateway_resource" "datasets-id-individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.dportal will be created
  + resource "aws_api_gateway_resource" "dportal" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "dportal"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.dportal_proxy will be created
  + resource "aws_api_gateway_resource" "dportal_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.entry_types will be created
  + resource "aws_api_gateway_resource" "entry_types" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "entry_types"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.filtering_terms will be created
  + resource "aws_api_gateway_resource" "filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants will be created
  + resource "aws_api_gateway_resource" "g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id will be created
  + resource "aws_api_gateway_resource" "g_variants-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_resource" "g_variants-id-biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id-individuals will be created
  + resource "aws_api_gateway_resource" "g_variants-id-individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals will be created
  + resource "aws_api_gateway_resource" "individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-filtering_terms will be created
  + resource "aws_api_gateway_resource" "individuals-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id will be created
  + resource "aws_api_gateway_resource" "individuals-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id-biosamples will be created
  + resource "aws_api_gateway_resource" "individuals-id-biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id-g_variants will be created
  + resource "aws_api_gateway_resource" "individuals-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.info will be created
  + resource "aws_api_gateway_resource" "info" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "info"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.map will be created
  + resource "aws_api_gateway_resource" "map" {
      + id          = (known after apply)
      + parent_id   = (k
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.